import React from 'react';

import { useAppDispatch, useAppSelector } from '../../hooks/redux';
import { sendMessage } from '../../store/slices/messagesSlice';

import { Input } from '../ui/input';

import './chat-form.scss'

export const ChatForm: React.FC = () => {
    const [value, setValue] = React.useState('')
    const uid = 'uCKnhsvh3chi7lddbqVp7Vbufl32'
    const dialogId = useAppSelector(store => store.dialogId.id)
    const dispatch = useAppDispatch()

    const handleSubmit = (e: React.FormEvent<HTMLFormElement>) => {
        e.preventDefault();

        if (value.trim()) {
            dispatch(sendMessage({
                id: dialogId,
                value,
                uid
            }))

            setValue('')
        }
    }

    return (
        <form className="chat__form" onSubmit={(e) => handleSubmit(e)}>
            <button className='chat__form-icon chat__form-attachment'>
                <svg width="25" height="26" viewBox="0 0 25 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.4649 23.8718C10.3703 26.7216 5.39452 26.7103 2.31714 23.832C-0.759359 20.9553 -0.771482 16.3004 2.27574 13.4058L2.27318 13.4042L13.4667 2.93498L14.8666 1.62619C17.1849 -0.542064 20.9429 -0.542064 23.2612 1.62619C25.5796 3.79445 25.5796 7.30965 23.2612 9.47874L10.9223 20.8993L10.918 20.8961C9.39739 22.2673 6.97377 22.2576 5.4713 20.8595C3.96883 19.4605 3.95936 17.2054 5.43246 15.7918L5.42813 15.7869L6.80207 14.5098L13.6719 8.1188L15.045 9.39751L6.80207 17.0656C6.04305 17.7708 6.04305 18.9154 6.80207 19.6213C7.56109 20.3273 8.79183 20.3273 9.54996 19.6213L21.8621 8.16828L21.8586 8.16586L21.9052 8.12845C23.4509 6.6832 23.4509 4.33865 21.9052 2.89348C20.3596 1.44832 17.8549 1.44823 16.3093 2.89348L16.2679 2.93739L16.2653 2.93572L14.8664 4.24368L3.67216 14.713C1.3538 16.8812 1.3538 20.3964 3.67216 22.5647C5.99052 24.7329 9.74935 24.7329 12.0659 22.5647L21.8605 13.4042L23.2595 12.0962L24.6584 13.4042L23.2595 14.713L13.4667 23.8735C13.4667 23.8734 13.4649 23.8718 13.4649 23.8718Z" fill="#A09BB1" />
                </svg>
            </button>
            <Input
                placeholder='Введите сообщение...'
                value={value}
                setValue={setValue}
                className='chat__form-field'
            />
            <button className='chat__form-icon chat__form-send'>
                <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fillRule="evenodd" clipRule="evenodd" d="M0.530248 0.396765C0.760104 0.191123 1.0444 0.058502 1.34785 0.0153579C1.65131 -0.0277863 1.96057 0.0204457 2.23726 0.154069L24.2553 10.8038C24.4781 10.9113 24.6664 11.0808 24.7982 11.2925C24.93 11.5042 25 11.7495 25 11.9999C25 12.2504 24.93 12.4957 24.7982 12.7074C24.6664 12.9191 24.4781 13.0886 24.2553 13.1961L2.23726 23.8458C1.97955 23.9703 1.69319 24.0209 1.40918 23.9921C1.12517 23.9634 0.854322 23.8563 0.625969 23.6825C0.397615 23.5087 0.22045 23.2748 0.113655 23.0062C0.00685854 22.7376 -0.0255001 22.4444 0.0200815 22.1585L1.64282 11.9999L0.0200815 1.84138C-0.0220934 1.57646 0.00257878 1.305 0.0917939 1.05238C0.181009 0.79975 0.331857 0.574191 0.530248 0.396765V0.396765ZM3.23481 12.8667L1.74987 22.1608L22.7567 11.9999L1.74987 1.83907L3.23481 11.1332H11.6184C11.8449 11.1332 12.0622 11.2245 12.2223 11.387C12.3825 11.5496 12.4725 11.7701 12.4725 11.9999C12.4725 12.2298 12.3825 12.4503 12.2223 12.6128C12.0622 12.7754 11.8449 12.8667 11.6184 12.8667H3.23481Z" fill="#A09BB1" />
                </svg>
            </button>
        </form>
    );
};

